zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_spi.c
  /* Disable IT if no more data excepted */
  if (hspi->RxXferCount == 0UL)
  {
#if defined(USE_SPI_RELOAD_TRANSFER)
    /* Check if there is any request to reload */
    if (hspi->Reload.Requested == 1UL)
    {
      hspi->RxXferSize  = hspi->Reload.RxXferSize;
      hspi->RxXferCount = hspi->Reload.RxXferSize;
      hspi->pRxBuffPtr  = hspi->Reload.pRxBuffPtr;
      hspi->Reload.Requested = 0UL;
    }
    else
    {
      /* Disable RXP interrupts */
      __HAL_SPI_DISABLE_IT(hspi, SPI_IT_RXP);
    }
#else
    /* Disable RXP interrupts */
    __HAL_SPI_DISABLE_IT(hspi, SPI_IT_RXP);
#endif /* USE_SPI_RELOAD_TRANSFER */
  }
}


/**
  * @brief  Handle the data 8-bit transmit in Interrupt mode.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_TxISR_8BIT(SPI_HandleTypeDef *hspi)
{
  /* Transmit data in 8 Bit mode */
  *(__IO uint8_t *)&hspi->Instance->TXDR = *((const uint8_t *)hspi->pTxBuffPtr);
  hspi->pTxBuffPtr += sizeof(uint8_t);
  hspi->TxXferCount--;

  /* Disable IT if no more data excepted */
  if (hspi->TxXferCount == 0UL)
  {
#if defined(USE_SPI_RELOAD_TRANSFER)
    /* Check if there is any request to reload */
    if (hspi->Reload.Requested == 1UL)
    {
      hspi->TxXferSize  = hspi->Reload.TxXferSize;
      hspi->TxXferCount = hspi->Reload.TxXferSize;
      hspi->pTxBuffPtr  = hspi->Reload.pTxBuffPtr;

      /* In full duplex mode the reload request is reset in RX side */
      if (hspi->State == HAL_SPI_STATE_BUSY_TX)
      {
        hspi->Reload.Requested = 0UL;
      }
    }
    else
    {
      /* Disable TXP interrupts */
      __HAL_SPI_DISABLE_IT(hspi, SPI_IT_TXP);
    }
#else
    /* Disable TXP interrupts */
    __HAL_SPI_DISABLE_IT(hspi, SPI_IT_TXP);
#endif /* USE_SPI_RELOAD_TRANSFER */
  }
}

/**
  * @brief  Handle the data 16-bit transmit in Interrupt mode.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_TxISR_16BIT(SPI_HandleTypeDef *hspi)
{
  /* Transmit data in 16 Bit mode */
#if defined (__GNUC__)
  __IO uint16_t *ptxdr_16bits = (__IO uint16_t *)(&(hspi->Instance->TXDR));

  *ptxdr_16bits = *((const uint16_t *)hspi->pTxBuffPtr);
#else
  *((__IO uint16_t *)&hspi->Instance->TXDR) = *((const uint16_t *)hspi->pTxBuffPtr);
#endif /* __GNUC__ */
  hspi->pTxBuffPtr += sizeof(uint16_t);
  hspi->TxXferCount--;

  /* Disable IT if no more data excepted */
  if (hspi->TxXferCount == 0UL)
  {
#if defined(USE_SPI_RELOAD_TRANSFER)
    /* Check if there is any request to reload */
    if (hspi->Reload.Requested == 1UL)
    {
      hspi->TxXferSize  = hspi->Reload.TxXferSize;
      hspi->TxXferCount = hspi->Reload.TxXferSize;
      hspi->pTxBuffPtr  = hspi->Reload.pTxBuffPtr;

      /* In full duplex mode the reload request is reset in RX side */
      if (hspi->State == HAL_SPI_STATE_BUSY_TX)
      {
        hspi->Reload.Requested = 0UL;
      }
    }
    else
    {
      /* Disable TXP interrupts */
      __HAL_SPI_DISABLE_IT(hspi, SPI_IT_TXP);
    }
#else
    /* Disable TXP interrupts */
    __HAL_SPI_DISABLE_IT(hspi, SPI_IT_TXP);
#endif /* USE_SPI_RELOAD_TRANSFER */
  }
}

/**
  * @brief  Handle the data 32-bit transmit in Interrupt mode.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_TxISR_32BIT(SPI_HandleTypeDef *hspi)
{
  /* Transmit data in 32 Bit mode */
  *((__IO uint32_t *)&hspi->Instance->TXDR) = *((const uint32_t *)hspi->pTxBuffPtr);
  hspi->pTxBuffPtr += sizeof(uint32_t);
  hspi->TxXferCount--;

  /* Disable IT if no more data excepted */
  if (hspi->TxXferCount == 0UL)
  {
#if defined(USE_SPI_RELOAD_TRANSFER)
    /* Check if there is any request to reload */
    if (hspi->Reload.Requested == 1UL)
    {
      hspi->TxXferSize  = hspi->Reload.TxXferSize;
      hspi->TxXferCount = hspi->Reload.TxXferSize;
      hspi->pTxBuffPtr  = hspi->Reload.pTxBuffPtr;

      /* In full duplex mode the reload request is reset in RX side */
      if (hspi->State == HAL_SPI_STATE_BUSY_TX)
      {
        hspi->Reload.Requested = 0UL;
      }
    }
    else
    {
      /* Disable TXP interrupts */
      __HAL_SPI_DISABLE_IT(hspi, SPI_IT_TXP);
    }
#else
    /* Disable TXP interrupts */
    __HAL_SPI_DISABLE_IT(hspi, SPI_IT_TXP);
#endif /* USE_SPI_RELOAD_TRANSFER */
  }
}

/**
  * @brief  Abort Transfer and clear flags.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
static void SPI_AbortTransfer(SPI_HandleTypeDef *hspi)
{
  /* Disable SPI peripheral */
  __HAL_SPI_DISABLE(hspi);

  /* Disable ITs */
  __HAL_SPI_DISABLE_IT(hspi, (SPI_IT_EOT | SPI_IT_TXP | SPI_IT_RXP | SPI_IT_DXP | SPI_IT_UDR | SPI_IT_OVR | \
                              SPI_IT_FRE | SPI_IT_MODF));

  /* Clear the Status flags in the SR register */
  __HAL_SPI_CLEAR_EOTFLAG(hspi);
  __HAL_SPI_CLEAR_TXTFFLAG(hspi);

  /* Disable Tx DMA Request */
  CLEAR_BIT(hspi->Instance->CFG1, SPI_CFG1_TXDMAEN | SPI_CFG1_RXDMAEN);

  /* Clear the Error flags in the SR register */
  __HAL_SPI_CLEAR_OVRFLAG(hspi);
  __HAL_SPI_CLEAR_UDRFLAG(hspi);
  __HAL_SPI_CLEAR_FREFLAG(hspi);
  __HAL_SPI_CLEAR_MODFFLAG(hspi);
  __HAL_SPI_CLEAR_SUSPFLAG(hspi);

#if (USE_SPI_CRC != 0U)
  __HAL_SPI_CLEAR_CRCERRFLAG(hspi);
#endif /* USE_SPI_CRC */

  hspi->TxXferCount = (uint16_t)0UL;
  hspi->RxXferCount = (uint16_t)0UL;
}


/**
  * @brief  Close Transfer and clear flags.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval HAL_ERROR: if any error detected
  *         HAL_OK: if nothing detected
  */
static void SPI_CloseTransfer(SPI_HandleTypeDef *hspi)
{
  uint32_t itflag = hspi->Instance->SR;

